os/procesos_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Procesos<sub>2</sub></title>
<!-- 2019-03-02 Sat 22:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jonatan Ahumada Fernández" />
</head>
<body>
<div id="content">
<h1 class="title">Procesos<sub>2</sub></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Recordar: 3 elementos</a></li>
<li><a href="#sec-2">2. Repaso: características</a></li>
<li><a href="#sec-3">3. Modelos</a></li>
<li><a href="#sec-4">4. Anotaciones:</a></li>
<li><a href="#sec-5">5. colas o hilos</a></li>
<li><a href="#sec-6">6. Ejercicio de ejemplo</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Recordar: 3 elementos</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>ejecutable
</li>
<li>datos asociados
</li>
<li>contexto de ejecución
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Repaso: características</h2>
<div class="outline-text-2" id="text-2">
<p>
funcionamiento no determinista
</p>
<ul class="org-ul">
<li>interbloqueo
</li>
<li>concurrencia
</li>
<li>etc.
</li>
</ul>

<p>
Estas características se ven plasmadas en los modelos de gestión de procesos. 
El aspecto práctico de esto será visto en el ejercicio de más abajo. 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Modelos</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>de dos estados 
</li>
<li>de cinco estados (el que es )
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Anotaciones:</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>no es lo mismo un proceso que sale, que uno interumpido. el interrumpido queda con variables asociadas. El de salida libera memoria.
</li>
<li>un proceso puede pasar de liso a terminado sin pasar por ejecución. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> colas o hilos</h2>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Ejercicio de ejemplo</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">proceso</td>
<td class="left">accion que solicita</td>
<td class="left">memoria requerida</td>
<td class="left">resultado/efecto de solicitud</td>
<td class="left">memoria restante</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">p1</td>
<td class="left">ejecución</td>
<td class="left">128 mb</td>
<td class="left">p1 -&gt; ejecucion</td>
<td class="left">256 -128=128mb</td>
</tr>

<tr>
<td class="left">p2</td>
<td class="left">ejecucion</td>
<td class="left">128  mb</td>
<td class="left">p1-&gt;listo no puede ejecutar,porque p1 no ha finalizado</td>
<td class="left">0 mb</td>
</tr>

<tr>
<td class="left">p3</td>
<td class="left">ejecucion</td>
<td class="left">64 mb</td>
<td class="left">p3-&gt; nuevo, no hay recursos que asignarle</td>
<td class="left">0mb</td>
</tr>

<tr>
<td class="left">p1</td>
<td class="left">terminar</td>
<td class="left">-</td>
<td class="left">p1-&gt;terminado , p2-&gt;ejecucion p3 -&gt;listo</td>
<td class="left">64 mb</td>
</tr>

<tr>
<td class="left">p2</td>
<td class="left">lectura de datos en disco</td>
<td class="left">-</td>
<td class="left">p2-&gt;bloqueado, p3-&gt;ejecución</td>
<td class="left">64 mb</td>
</tr>

<tr>
<td class="left">p4</td>
<td class="left">ejecucion</td>
<td class="left">128</td>
<td class="left">p4 -&gt;nuevo</td>
<td class="left">64 mb</td>
</tr>

<tr>
<td class="left">p2</td>
<td class="left">fin lectura datos</td>
<td class="left">-</td>
<td class="left">p2 -&gt;listo</td>
<td class="left">64 mb</td>
</tr>

<tr>
<td class="left">p3</td>
<td class="left">terminado</td>
<td class="left">-</td>
<td class="left">p3-&gt;terminado, p4-&gt;listo,p2-&gt;ejecucion</td>
<td class="left">0</td>
</tr>

<tr>
<td class="left">p5</td>
<td class="left">ejecucion</td>
<td class="left">64</td>
<td class="left">p5-&gt;nuevo</td>
<td class="left">0</td>
</tr>
</tbody>
</table>




<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">p. nuevo</td>
<td class="left">p. ejecucion</td>
<td class="left">cola de listos</td>
<td class="right">bloqueados</td>
<td class="left">terminados</td>
<td class="right">memoria</td>
</tr>

<tr>
<td class="left">p5</td>
<td class="left">p2</td>
<td class="left">p4</td>
<td class="right">0</td>
<td class="left">p1 p3</td>
<td class="right">0</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: &lt;2019-02-9 Sun&gt;</p>
<p class="author">Author: Jonatan Ahumada Fernández</p>
<p class="date">Created: 2019-03-02 Sat 22:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
